load-tests/chat-api.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 2
      name: "Warm up"
    - duration: 30
      arrivalRate: 10
      name: "Sustained load"

scenarios:
  - name: "Flujo: Iniciar sesión y enviar mensaje"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "ardannyromero@gmail.com"
            password: "000000"
          capture:
            - json: "$.token"
              as: "jwt_token"
      - think: 2
      - post:
          url: "/api/chat/message"
          headers:
            Authorization: "Bearer {{ jwt_token }}"
          json:
            chatId: "6a0321b0cbcb9e0ee5857ccc"
            content: "Hola, esta es una prueba de carga generada por Artillery --- Borren el grupo..."