load-tests/chat_messageLifecycle.yml
config:
  target: "http://localhost:3000"
  variables:
    token: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjZhMTQ4ZTE2NjcyNDVmNjczNTRhNDMyYiIsInJvbGUiOiJ1c2VyIiwiaWF0IjoxNzc5NzU4MjY2LCJleHAiOjE3Nzk4NDQ2NjZ9.uIGtqsi7TJ-2nSMYPWeOLsyiSLkBiZ6Wkz_PDI4MCb8"
    chatId: "6a14a72a3c7618a228b4ff66" 
  phases:
    - duration: 30
      arrivalRate: 2
      name: "Fase 1: Calentamiento"
    - duration: 60
      arrivalRate: 2
      rampTo: 25
      name: "Fase 2: Escalamiento"
    - duration: 30
      arrivalRate: 40
      name: "Fase 3: Pico de estrés masivo"
scenarios:
  - name: "Enviar mensaje y eliminarlo para todos"
    flow:
      - post:
          url: "/api/chats/message"
          headers:
            Authorization: "{{ token }}"
          json:
            chatId: "{{ chatId }}"
            content: "Mensaje de carga desde Artillery"
          capture:
            - json: "$.message._id"
              as: "messageId"
      - delete:
          url: "/api/chats/message/{{ messageId }}"
          headers:
            Authorization: "{{ token }}"
          json:
            type: "for_all"